Revit 2027 API
OptionalFunctionalityUtils.IsSTLImportLinkAvailable Method
 Checks whether the STL Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSTLImportLinkAvailable()
Public Shared Function IsSTLImportLinkAvailable As Boolean
public:
static bool IsSTLImportLinkAvailable()
static member IsSTLImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the STL Import/Link functionality is available in the installed Revit.
Remarks
 STL Import/Link is optional functionality that does not have to be a part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace